tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
brew "glib"
brew "at-spi2-core"
brew "azure-cli"
brew "bash"
brew "libgit2"
brew "bat"
brew "btop"
brew "clang-format"
brew "coreutils"
brew "eza"
brew "fd"
brew "findutils"
brew "fzf"
brew "gcc"
brew "libtiff"
brew "gdk-pixbuf"
brew "git"
brew "git-review"
brew "gnu-sed"
brew "unbound"
brew "gnutls"
brew "utf8proc", args: ["HEAD"]
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "gsettings-desktop-schemas"
brew "harfbuzz"
brew "pango"
brew "gtk+3"
brew "gtk4"
brew "htop"
brew "lazygit"
brew "libgccjit"
brew "librsvg"
brew "libxml2"
brew "libzip"
brew "midnight-commander"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "openjdk"
brew "openldap"
brew "osx-cpu-temp"
brew "pipenv"
brew "pipx"
brew "py3cairo"
brew "pygobject3"
brew "repo"
brew "ripgrep"
brew "shellcheck"
brew "stow"
brew "syncthing", restart_service: :changed
brew "tldr"
brew "tmux"
brew "tree"
brew "virtualenv"
brew "vte3"
brew "wget"
brew "xclip"
brew "yazi"
brew "zsh-syntax-highlighting"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-modern-doom3-icon", "with-native-comp"]
brew "felixkratz/formulae/borders"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "iterm2"
cask "meld"
cask "slack"
cask "wezterm"
vscode "charliermarsh.ruff"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "meezilla.json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "vscodevim.vim"
