brew "bash"
brew "bat"
brew "coreutils"
brew "fd"
brew "git"
brew "gnu-sed"
brew "lazygit"
brew "utf8proc", args: ["HEAD"]
brew "neovim"
brew "node"
brew "osx-cpu-temp"
brew "python@3.13"
brew "pipx"
brew "ripgrep"
brew "stow"
brew "virtualenv"
brew "wimlib"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "iterm2"
